integration/tests.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://services.integration.groupe.polytech.unice.fr/">
   <soapenv:Header/>
   <soapenv:Body>
      <ser:createOrder>
         <!--Optional:-->
         <order>
            <cardNumber>123456890098765</cardNumber>
            <id>1</id>
            <invoiceAddress>
               <line1>AA</line1>
               <!--Optional:-->
               <line2>BB</line2>
               <city>FF</city>
               <country>RT</country>
               <!--Optional:-->
               <kind>PERSONAL</kind>
               <zip>2235</zip>
            </invoiceAddress>
            <name>Ad;zp</name>
            <products>
               <!--Zero or more repetitions:-->
               <entry>
                  <!--Optional:-->
                  <key>J7W5PI2IQ29CQ6K</key>
                  <!--Optional:-->
                  <value>5</value>
               </entry>
               <entry>
                  <!--Optional:-->
                  <key>B8M6GJ4JX48ZL1N</key>
                  <!--Optional:-->
                  <value>1</value>
               </entry>
            </products>
            <shippingAddress>
               <line1>AA</line1>
               <!--Optional:-->
               <line2>BB</line2>
               <city>FF</city>
               <country>RT</country>
               <!--Optional:-->
               <kind>PERSONAL</kind>
               <zip>2235</zip>
            </shippingAddress>
         </order>
      </ser:createOrder>
   </soapenv:Body>
</soapenv:Envelope>